
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 6 to add, 4 to change, 7 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.redis_connection_string
  * module.darts_key_vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.darts_migration_key_vault[0].azurerm_key_vault.kv
  * module.darts_migration_key_vault[0].azurerm_monitor_diagnostic_setting.kv-ds
* Delete
  * module.darts_redis.azurerm_resource_group.cache-resourcegroup[0]
* Replace
  * module.darts_migration_key_vault[0].azurerm_key_vault_access_policy.creator_access_policy
  * module.darts_migration_key_vault[0].azurerm_key_vault_access_policy.developer[0]
  * module.darts_migration_key_vault[0].azurerm_key_vault_access_policy.managed_identity_access_policy[&#34;b31f6666-e2e4-4a0b-9399-b64446b1e412&#34;]
  * module.darts_migration_key_vault[0].azurerm_key_vault_access_policy.product_team_access_policy
  * module.darts_redis.azurerm_private_endpoint.this[0]
  * module.darts_redis.azurerm_redis_cache.redis


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.redis_connection_string will be updated in-place
  # (moved from azurerm_key_vault_secret.redis_connection_string[0])
  ~ resource "azurerm_key_vault_secret" "redis_connection_string" {
        id                      = "https://darts-stg.vault.azure.net/secrets/redis-connection-string/e23d22230c5a49eab53940f4ed897144"
        name                    = "redis-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.darts_key_vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.KeyVault/vaults/darts-stg|darts-stg"
        name                           = "darts-stg"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.darts_migration_key_vault[0].data.azuread_group.developers will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_group" "developers" {
      + assignable_to_role             = (known after apply)
      + auto_subscribe_new_members     = (known after apply)
      + behaviors                      = (known after apply)
      + description                    = (known after apply)
      + display_name                   = "DTS Darts Admin (env:staging)"
      + dynamic_membership             = (known after apply)
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_enabled                   = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + provisioning_options           = (known after apply)
      + proxy_addresses                = (known after apply)
      + security_enabled               = (known after apply)
      + theme                          = (known after apply)
      + types                          = (known after apply)
      + visibility                     = (known after apply)
      + writeback_enabled              = (known after apply)
    }

  # module.darts_migration_key_vault[0].data.azuread_group.product_team[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_group" "product_team" {
      + assignable_to_role             = (known after apply)
      + auto_subscribe_new_members     = (known after apply)
      + behaviors                      = (known after apply)
      + description                    = (known after apply)
      + display_name                   = "DTS Darts Modernisation"
      + dynamic_membership             = (known after apply)
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_enabled                   = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + provisioning_options           = (known after apply)
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + theme                          = (known after apply)
      + types                          = (known after apply)
      + visibility                     = (known after apply)
      + writeback_enabled              = (known after apply)
    }

  # module.darts_migration_key_vault[0].data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.darts_migration_key_vault[0].azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg"
        name                            = "darts-migration-stg"
        tags                            = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
      ~ tenant_id                       = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.darts_migration_key_vault[0].azurerm_key_vault_access_policy.creator_access_policy must be replaced
-/+ resource "azurerm_key_vault_access_policy" "creator_access_policy" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg/objectId/7ef3b6ce-3974-41ab-8512-c3ef4bb8ae01" -> (known after apply)
      - storage_permissions     = [] -> null
      ~ tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" # forces replacement -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.darts_migration_key_vault[0].azurerm_key_vault_access_policy.developer[0] must be replaced
-/+ resource "azurerm_key_vault_access_policy" "developer" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg/objectId/d51b8769-b737-4706-abd2-23d33b38b8c0" -> (known after apply)
      ~ object_id               = "d51b8769-b737-4706-abd2-23d33b38b8c0" # forces replacement -> (known after apply)
      - storage_permissions     = [] -> null
      ~ tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" # forces replacement -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.darts_migration_key_vault[0].azurerm_key_vault_access_policy.managed_identity_access_policy["b31f6666-e2e4-4a0b-9399-b64446b1e412"] must be replaced
-/+ resource "azurerm_key_vault_access_policy" "managed_identity_access_policy" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg/objectId/b31f6666-e2e4-4a0b-9399-b64446b1e412" -> (known after apply)
      - storage_permissions     = [] -> null
      ~ tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" # forces replacement -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.darts_migration_key_vault[0].azurerm_key_vault_access_policy.product_team_access_policy must be replaced
-/+ resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg/objectId/87c8cf3d-ff9d-4d8f-8430-ccc737764435" -> (known after apply)
      ~ object_id               = "87c8cf3d-ff9d-4d8f-8430-ccc737764435" # forces replacement -> (known after apply)
      - storage_permissions     = [] -> null
      ~ tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" # forces replacement -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.darts_migration_key_vault[0].azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg|darts-migration-stg"
        name                           = "darts-migration-stg"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.darts_redis.azurerm_private_endpoint.this[0] must be replaced
  # (moved from module.darts_redis[0].azurerm_private_endpoint.this[0])
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-cache-stg/providers/Microsoft.Network/privateEndpoints/darts-stg" -> (known after apply)
        name                     = "darts-stg"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-cache-stg/providers/Microsoft.Network/networkInterfaces/darts-stg.nic.4c1a6c91-1fb4-4004-87f5-124793d95b4b"
              - name = "darts-stg.nic.4c1a6c91-1fb4-4004-87f5-124793d95b4b"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-cache-stg/providers/Microsoft.Network/privateEndpoints/darts-stg/privateDnsZoneGroups/redis-endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.redis.cache.windows.net"
              - name                = "privatelink.redis.cache.windows.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "darts-stg.privatelink.redis.cache.windows.net"
                      - ip_addresses = [
                          - "10.148.32.14",
                        ]
                      - name         = "darts-stg"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      ~ resource_group_name      = "darts-cache-stg" -> "darts-stg-rg" # forces replacement
        tags                     = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (2 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-cache-stg/providers/Microsoft.Network/privateEndpoints/darts-stg/privateDnsZoneGroups/redis-endpoint-dnszonegroup" -> (known after apply)
            name                 = "redis-endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "darts-stg"
          ~ private_connection_resource_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-cache-stg/providers/Microsoft.Cache/redis/darts-stg" # forces replacement -> (known after apply)
          ~ private_ip_address             = "10.148.32.14" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.darts_redis.azurerm_redis_cache.redis must be replaced
  # (moved from module.darts_redis[0].azurerm_redis_cache.redis)
-/+ resource "azurerm_redis_cache" "redis" {
      ~ hostname                      = "darts-stg.redis.cache.windows.net" -> (known after apply)
      ~ id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-cache-stg/providers/Microsoft.Cache/redis/darts-stg" -> (known after apply)
        name                          = "darts-stg"
      ~ port                          = 6379 -> (known after apply)
      ~ primary_access_key            = (sensitive value)
      ~ primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      ~ redis_version                 = "6.0" -> "6"
      ~ replicas_per_master           = 0 -> (known after apply)
      ~ replicas_per_primary          = 0 -> (known after apply)
      ~ resource_group_name           = "darts-cache-stg" -> "darts-stg-rg" # forces replacement
      ~ secondary_access_key          = (sensitive value)
      ~ secondary_connection_string   = (sensitive value)
      - shard_count                   = 0 -> null
      ~ ssl_port                      = 6380 -> (known after apply)
        tags                          = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
      - tenant_settings               = {} -> null
      - zones                         = [] -> null
        # (7 unchanged attributes hidden)

      ~ redis_configuration {
          - aof_backup_enabled              = false -> null
          ~ maxclients                      = 7500 -> (known after apply)
          - rdb_backup_enabled              = false -> null
          - rdb_backup_frequency            = 0 -> null
          - rdb_backup_max_snapshot_count   = 0 -> null
            # (5 unchanged attributes hidden)
        }
    }

  # module.darts_redis.azurerm_resource_group.cache-resourcegroup[0] will be destroyed
  # (because index [0] is out of range for count)
  # (moved from module.darts_redis[0].azurerm_resource_group.cache-resourcegroup[0])
  - resource "azurerm_resource_group" "cache-resourcegroup" {
      - id       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-cache-stg" -> null
      - location = "uksouth" -> null
      - name     = "darts-cache-stg" -> null
      - tags     = {
          - "application"         = "darts"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#darts-devs"
          - "environment"         = "staging"
          - "managedBy"           = "Darts Modernisation"
        } -> null
    }

Plan: 6 to add, 4 to change, 7 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":123,"Program":"tfcmt","SHA1":"","Vars":{}} -->